/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   validation.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tishihar <tishihar@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/01/07 21:21:31 by tishihar          #+#    #+#             */
/*   Updated: 2025/01/07 22:30:51 by tishihar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

// int以内に収まっているかをみながらintに変換する関数　出力：int
int	validation_and_atoi(char *c)
{
	
}


// 挿入する前にその数字がスタックに存在しないかを見る関数. すたっく　いんと
bool	is_already_exist(t_stack *stack_, int value)
{
	
}
